# St7GetResultFileCombTargetFileName

Returns the name of the target file produced when forming a combined result file.

long St7GetResultFileCombTargetFileName(long uID, char* FileName,

long MaxStringLen)

Input Parameters

uID

Strand7 model file ID.

MaxStringLen

Maximum number of characters allocated for FileName.

Output Parameters
FileName

Full path and name for the target file.